{"keras_version": "1.0.5", "loss": "binary_crossentropy", "sample_weight_mode": null, "optimizer": {"name": "Adam", "epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421}, "config": [{"config": {"activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 10, 10, 10], "b_regularizer": null, "dim_ordering": "th", "nb_filter": 10, "nb_row": 10, "border_mode": "same", "W_regularizer": null, "input_dtype": "float32", "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_13", "activation": "linear", "nb_col": 2, "b_constraint": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_22", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "nb_filter": 10, "trainable": true, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_14", "activation": "linear", "nb_col": 3, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_23", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.1, "trainable": true, "name": "dropout_13"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "nb_filter": 40, "trainable": true, "nb_row": 5, "border_mode": "same", "W_regularizer": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_15", "activation": "linear", "nb_col": 3, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_24", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "nb_filter": 40, "trainable": true, "nb_row": 5, "border_mode": "valid", "W_regularizer": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_16", "activation": "linear", "nb_col": 3, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_25", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "th", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_4", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.1, "trainable": true, "name": "dropout_14"}, "class_name": "Dropout"}, {"config": {"name": "flatten_4", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 480, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "input_dim": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "dense_10", "activation": "linear", "bias": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_26", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_15"}, "class_name": "Dropout"}, {"config": {"output_dim": 480, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "input_dim": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "dense_11", "activation": "linear", "bias": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_27", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_16"}, "class_name": "Dropout"}, {"config": {"output_dim": 1, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "input_dim": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "dense_12", "activation": "linear", "bias": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_28", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}], "class_name": "Sequential"}